import random

answers = ["Бесспорно", "Мне кажется - да", "Пока неясно, попробуй снова", "Даже не думай",
           "Предрешено", "Вероятнее всего", "Спроси позже", "Мой ответ - нет",
           "Никаких сомнений", "Хорошие перспективы", "Лучше не рассказывать", "По моим данным - нет",
           "Можешь быть уверен в этом", "Да", "Сконцентрируйся и спроси опять", "Весьма сомнительно"]
print('Привет, я магический шар. Я знаю ответ на любой вопрос!')
name = input('Как я могу к Вам обращаться? ')
print('Привет, ' + name)

while True:
    ball = input('Задайте свой вопрос. ')
    print(random.choice(answers))
    again = input('Попробовать снова?: да, нет ').lower()
    if again == 'нет':
        print('Жду Ваших вопросов еще! Удачи.')
        break
